uhnp/src/Documents/ЗаявкаНаПривлечениеФинансирования/ЗаявкаНаПривлечениеФинансирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПривлечениеФинансирования</name>
  <registerRecords>AccumulationRegister.ОперацииБюджетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансирования</name>
    <type>
      <types>EnumRef.ВидыФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаимствования</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПривлечения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьНачисленияПроцентов</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПроцентов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредствОсновнойДолг</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолг1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолг2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолг3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолг4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолг5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолг6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяИсполнение</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаИсполнение1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаИсполнение2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаИсполнение3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаИсполнение4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаИсполнение5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаИсполнение6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредствОсновнойДолгВозврат</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолгВозврат1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолгВозврат2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолгВозврат3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолгВозврат4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолгВозврат5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОсновнойДолгВозврат6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикУплатыПроцентов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНаОплате</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОплачено</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеактивен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПредназначенияЭлементовСтруктурыОтчета/ПредназначенияЭлементовСтруктурыОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПредназначенияЭлементовСтруктурыОтчета</name>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ОборотноСальдоваяВедомость</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>БюджетДоходовИРасходов</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ТрансформационныеКорректировки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/РежимыИспользованияГрафика/РежимыИспользованияГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыИспользованияГрафика</name>
  <enumValues>
    <name>РезервированиеБюджетаИКонтрольСоблюденияГрафика</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическоеСозданиеПлатежныхПозиций</name>
  </enumValues>
  <enumValues>
    <name>ТолькоРезервированиеБюджета</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ЗаявкаНаКорректировкуПланов/ЗаявкаНаКорректировкуПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаКорректировкуПланов</name>
  <registerRecords>AccumulationRegister.ОперацииБюджетов</registerRecords>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОбъектыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.ДоговорКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планы</name>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>DefinedType.Организация</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектКонтроля</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерв</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезерва</name>
      <type>
        <types>DefinedType.ОбъектыПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Свободно</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/ChartsOfCharacteristicTypes/ВидыБюджетов/ВидыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыБюджетов</name>
  <type>
    <types>CatalogRef.СтатьиДоходовИРасходов</types>
    <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.ГруппыСтатейБюджета</types>
  </type>
  <predefined>
    <items>
      <name>БюджетДвиженияДенежныхСредств</name>
      <description>Бюджет движения денежных средств</description>
      <code>БДДС</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>БюджетДоходовИРасходов</name>
      <description>Бюджет доходов и расходов</description>
      <code>БДР</code>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </items>
    <items>
      <name>БюджетДвиженияРесурсов</name>
      <description>Бюджет закупок</description>
      <code>Ресурсы</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияРесурсов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВалютнаяПоУмолчанию</name>
    <type>
      <types>EnumRef.ВариантыУстановкиПризнакаВалютнаяСтатьиБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтролироватьНаправление</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

uhnp/src/Documents/ЗаявкаНаПривлечениеФинансирования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область СтандартныеПодсистемыКоманды

// Добавляет команду создания объекта на основании.
// 
// Параметры:
// 	КомандыСозданияНаОсновании - ТаблицаЗначений - перечень команд
// Возвращаемое значение:
// 	Неопределено, СтрокаТаблицыЗначений - Добавленная Команда.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	МетаданныеДокумента = ПустаяСсылка().Метаданные();
	
	Если ПравоДоступа("Добавление", МетаданныеДокумента) Тогда
		
		КомандаСоздатьНаОсновании						= КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер				= МетаданныеДокумента.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление			= ОбщегоНазначения.ПредставлениеОбъекта(МетаданныеДокумента);
		КомандаСоздатьНаОсновании.РежимЗаписи			= "Записывать";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Заполняет список команд создания на основании.
// 
// Параметры:
// 	КомандыСозданияНаОсновании - ТаблицаЗначений - перечень команд
// 	Параметры - Структура - параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ЗаявкаНаКорректировкуПланов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании); 
    Документы.КорректировкаПланов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);   	
	
КонецПроцедуры

#КонецОбласти   

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
Функция ПроверитьВозможностьУстановкиСостояния(ОбъектСсылка, СостояниеОбъекта, ПротоколОшибок = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектСсылка) <> Тип("ДокументСсылка.ЗаявкаНаПривлечениеФинансирования") Тогда
		ТекстОшибки = СтрШаблон( 
			НСтр("ru = 'Объект %1 не является заявкой на привлечение финансирования'"),
			ОбъектСсылка);
		УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(
			ПротоколОшибок, ОбъектСсылка, ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	ПроверкаПройдена = Истина;
	
	Если СостояниеОбъекта = Перечисления.СостоянияСогласования.Утверждена Тогда
		
		// Основной вариант финансирования
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаОперацию.Ссылка КАК Ссылка,
		|	ЗаявкаНаОперацию.Организация КАК Организация,
		|	ЗаявкаНаОперацию.ЦФО КАК ЦФО,
		|	ЗаявкаНаОперацию.СуммаЗаимствования КАК СуммаДокумента,
		|	ЗаявкаНаОперацию.ВалютаДокумента КАК ВалютаДокумента		
		|ИЗ
		|	Документ.ЗаявкаНаПривлечениеФинансирования КАК ЗаявкаНаОперацию
		|ГДЕ
		|	ЗаявкаНаОперацию.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
		
		ДанныеДокумента = Запрос.Выполнить().Выгрузить()[0];
		
		РеквизитыПроверяемыеНаЗаполнение = Новый СписокЗначений;
		РеквизитыПроверяемыеНаЗаполнение.Добавить("Организация", НСтр("ru = 'Организация'"));
		РеквизитыПроверяемыеНаЗаполнение.Добавить("СуммаДокумента", НСтр("ru = 'Сумма привлечения'"));
		РеквизитыПроверяемыеНаЗаполнение.Добавить("ВалютаДокумента", НСтр("ru = 'Валюта документа'"));
		Для Каждого ПроверяемыйРеквизит из РеквизитыПроверяемыеНаЗаполнение Цикл
			Если Не ЗначениеЗаполнено(ДанныеДокумента[ПроверяемыйРеквизит.Значение]) Тогда
				
				ПроверкаПройдена = Ложь;
				
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле","Заполнение",ПроверяемыйРеквизит.Представление);
				УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, ОбъектСсылка, ТекстОшибки, "Объект." + ПроверяемыйРеквизит.Значение);
				
			КонецЕсли;
		КонецЦикла;
			
		ПараметрыБюджета = ДвиженияБюджетированиеКлиентСерверУХ.ПараметрыБюджета(Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств);
		
				
	КонецЕсли;
	
	Если ОбъектСсылка.ПометкаУдаления И (СостояниеОбъекта = Перечисления.СостоянияСогласования.Утверждена 
		ИЛИ СостояниеОбъекта = Перечисления.СостоянияСогласования.Отклонена 
		ИЛИ СостояниеОбъекта = Перечисления.СостоянияСогласования.НаУтверждении) тогда
		
		ТекстОшибки = НСтр("ru = 'Установлена пометка удаления'");
		УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(
			ПротоколОшибок, ОбъектСсылка, ТекстОшибки);
		ПроверкаПройдена = Ложь;
	КонецЕсли;
	
	Возврат ПроверкаПройдена;
	
КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 

КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	// реквизиты документа.
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	ТекстыЗапроса 	= Новый СписокЗначений;
	
	ПланированиеПотребностей.ПодготовитьТаблицуДвиженийПоПланамДокумента(Запрос, ДополнительныеСвойства.ТаблицыДляДвижений, "ВТ_ПланыДокумента");
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка) Экспорт
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Реквизиты.Ссылка КАК Ссылка,
		|	Реквизиты.Дата КАК Дата,
		|	Реквизиты.Организация КАК Организация,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПланирования,
		|	Реквизиты.Ответственный КАК Ответственный,
		|	ЗНАЧЕНИЕ(Перечисление.РежимыИспользованияГрафика.РезервированиеБюджетаИКонтрольСоблюденияГрафика) КАК РежимИспользованияГрафика,
		|	Реквизиты.ЦФО КАК ЦФО,
		|	Реквизиты.Проект КАК Проект,
		|	Реквизиты.СуммаЗаимствования КАК СуммаЗаимствования,
		|	Реквизиты.ВидФинансирования КАК ВидФинансирования,
		|	Реквизиты.ДатаПривлечения КАК ДатаПривлечения,
		|	Реквизиты.ДатаВозврата КАК ДатаВозврата,
		|	Реквизиты.ВалютаДокумента КАК Валюта
		|ИЗ
		|	Документ.ЗаявкаНаПривлечениеФинансирования КАК Реквизиты
		|ГДЕ
		|	Реквизиты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
		
	Для Каждого ТекРеквизит Из Реквизиты Цикл
		Запрос.УстановитьПараметр(ТекРеквизит.Ключ, ТекРеквизит.Значение);
	КонецЦикла;

	Запрос.МенеджерВременныхТаблиц = Документы.ЗаявкаНаПривлечениеФинансирования.ПланыДокумента(ДокументСсылка, Запрос.МенеджерВременныхТаблиц); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИсточникиДляКонтроляДокумента
	
Функция ИсточникиДокумента(Объект, ДопПараметры = Неопределено) Экспорт
	
	Источники = Новый Соответствие;
	
	// 1. Источник для контроля бюджетных лимитов и резервов
	КонтрольУХ.ДобавитьИсточник(
		Источники, 
		КонтрольУХБюджетныеЛимиты, 
		Источник_БюджетныеЛимитыРезервы(Объект));

	Возврат Источники;
	
КонецФункции
	
Функция Источник_БюджетныеЛимитыРезервы(Объект)
	
	// Доп.параметры
	ДопПараметрыИсточника = Новый Структура;
	ДопПараметрыИсточника.Вставить("Дата", 				Объект.Дата);
	ДопПараметрыИсточника.Вставить("Ссылка", 			Объект.Ссылка);
	ДопПараметрыИсточника.Вставить("ЭтоНовый", 			НЕ ЗначениеЗаполнено(Объект.Ссылка));
	ДопПараметрыИсточника.Вставить("ДатаКонтроляЛимита", Объект.Дата);
	

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПланыДокумента(Объект);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ПланыДокумента.ВидБюджета КАК ВидБюджета,
	|	ВТ_ПланыДокумента.Организация КАК Организация,
	|	ВТ_ПланыДокумента.Валюта КАК Валюта,
	|	ВТ_ПланыДокумента.ДокументПланирования КАК ДокументПланирования,
	|	НЕОПРЕДЕЛЕНО КАК ДокументРезервирования,
	|	ВТ_ПланыДокумента.Период КАК ДатаОперации,
	|	ВТ_ПланыДокумента.ЦФО КАК ЦФО,
	|	ВТ_ПланыДокумента.Проект КАК Проект,
	|	ВТ_ПланыДокумента.ПриходРасход КАК ПриходРасход,
	|	ВТ_ПланыДокумента.СтатьяБюджета КАК СтатьяБюджета,
	|	ВТ_ПланыДокумента.Аналитика1 КАК Аналитика1,
	|	ВТ_ПланыДокумента.Аналитика2 КАК Аналитика2,
	|	ВТ_ПланыДокумента.Аналитика3 КАК Аналитика3,
	|	ВТ_ПланыДокумента.Аналитика4 КАК Аналитика4,
	|	ВТ_ПланыДокумента.Аналитика5 КАК Аналитика5,
	|	ВТ_ПланыДокумента.Аналитика6 КАК Аналитика6,
	|	0 КАК Лимит,
	|	СУММА(ВТ_ПланыДокумента.Сумма) КАК Зарезервировано,
	|	0 КАК Заявлено,
	|	0 КАК Исполнено
	|ПОМЕСТИТЬ ВТ_ТаблицаПлановССуммамиЛимитирования
	|ИЗ
	|	ВТ_ПланыДокумента КАК ВТ_ПланыДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПланыДокумента.Аналитика6,
	|	ВТ_ПланыДокумента.ДокументПланирования,
	|	ВТ_ПланыДокумента.Аналитика1,
	|	ВТ_ПланыДокумента.ВидБюджета,
	|	ВТ_ПланыДокумента.ЦФО,
	|	ВТ_ПланыДокумента.СтатьяБюджета,
	|	ВТ_ПланыДокумента.Аналитика4,
	|	ВТ_ПланыДокумента.Аналитика3,
	|	ВТ_ПланыДокумента.Проект,
	|	ВТ_ПланыДокумента.Аналитика5,
	|	ВТ_ПланыДокумента.Организация,
	|	ВТ_ПланыДокумента.Период,
	|	ВТ_ПланыДокумента.Валюта,
	|	ВТ_ПланыДокумента.ПриходРасход,
	|	ВТ_ПланыДокумента.Аналитика2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПланыДокумента";
	
	Запрос.Выполнить();
	
	//
	Источник = Новый Структура;
	Источник.Вставить("Параметры", 		ДопПараметрыИсточника);
	Источник.Вставить("ПланыДокумента", Запрос.МенеджерВременныхТаблиц);
	
	Возврат Источник;
	
	
КонецФункции

#КонецОбласти 

#Область ПланыДокумента

// Процедура возвращает таблицу планов документа
//
// Параметры:
//  Источник  - ДокументСсылка, ДокументОбъект, Форма.Объект - Документ планирования
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Таблица планов документа
//
Функция ПланыДокумента(Источник, МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Иначе
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", 		Источник.Ссылка);
	Запрос.УстановитьПараметр("ЗаявкаПустая", 	Документы.ЗаявкаНаПривлечениеФинансирования.ПустаяСсылка());
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Заявка.Дата КАК ДатаРегистрации,
	|	Заявка.Организация КАК Организация,
	|	Заявка.ВалютаДокумента КАК Валюта,
	|	Заявка.Ссылка КАК ДокументПланирования,
	|	Заявка.Дата КАК Период,
	|	Заявка.ЦФО КАК ЦФО,
	|	Заявка.Проект КАК Проект,
	|	Заявка.СтатьяДвиженияДенежныхСредств КАК СтатьяБюджета,
	|	Заявка.Аналитика1 КАК Аналитика1,
	|	Заявка.Аналитика2 КАК Аналитика2,
	|	Заявка.Аналитика3 КАК Аналитика3,
	|	Заявка.Аналитика4 КАК Аналитика4,
	|	Заявка.Аналитика5 КАК Аналитика5,
	|	Заявка.Аналитика6 КАК Аналитика6,
	|	0 КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход) КАК ПриходРасход,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств) КАК ВидБюджета
	|ПОМЕСТИТЬ ВТ_ПланыДокумента
	|ИЗ
	|	Документ.ЗаявкаНаПривлечениеФинансирования КАК Заявка
	|ГДЕ
	|	Заявка.Ссылка = &ЗаявкаПустая
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ДатаДокумента,
	|	&Организация,
	|	&Валюта,
	|	&Ссылка,
	|	&ДатаПривлечения,
	|	&ЦФО,
	|	&Проект,
	|	&СтатьяДвиженияДенежныхСредствОсновнойДолг,
	|	&АналитикаОсновнойДолг1,
	|	&АналитикаОсновнойДолг2,
	|	&АналитикаОсновнойДолг3,
	|	&АналитикаОсновнойДолг4,
	|	&АналитикаОсновнойДолг5,
	|	&АналитикаОсновнойДолг6,
	|	&СуммаЗаимствования,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ДатаДокумента,
	|	&Организация,
	|	&Валюта,
	|	&Ссылка,
	|	ГрафикРасчетов.Дата,
	|	&ЦФО,
	|	&Проект,
	|	&СтатьяДвиженияДенежныхСредств,
	|	&Аналитика1,
	|	&Аналитика2,
	|	&Аналитика3,
	|	&Аналитика4,
	|	&Аналитика5,
	|	&Аналитика6,
	|	ГрафикРасчетов.Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств)
	|ИЗ
	|	Документ.ЗаявкаНаПривлечениеФинансирования.ГрафикУплатыПроцентов КАК ГрафикРасчетов
	|ГДЕ
	|	ГрафикРасчетов.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ДатаДокумента,
	|	&Организация,
	|	&Валюта,
	|	&Ссылка,
	|	ГрафикРасчетов.Дата,
	|	&ЦФО,
	|	&Проект,
	|	&ОсновнаяСтатьяИсполнение,
	|	&АналитикаИсполнение1,
	|	&АналитикаИсполнение2,
	|	&АналитикаИсполнение3,
	|	&АналитикаИсполнение4,
	|	&АналитикаИсполнение5,
	|	&АналитикаИсполнение6,
	|	ГрафикРасчетов.Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов)
	|ИЗ
	|	Документ.ЗаявкаНаПривлечениеФинансирования.ГрафикУплатыПроцентов КАК ГрафикРасчетов
	|ГДЕ
	|	ГрафикРасчетов.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ДатаДокумента,
	|	&Организация,
	|	&Валюта,
	|	&Ссылка,
	|	&ДатаВозврата,
	|	&ЦФО,
	|	&Проект,
	|	&СтатьяДвиженияДенежныхСредствОсновнойДолгВозврат,
	|	&АналитикаОсновнойДолгВозврат1,
	|	&АналитикаОсновнойДолгВозврат2,
	|	&АналитикаОсновнойДолгВозврат3,
	|	&АналитикаОсновнойДолгВозврат4,
	|	&АналитикаОсновнойДолгВозврат5,
	|	&АналитикаОсновнойДолгВозврат6,
	|	&СуммаЗаимствования,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств)";

	Если ТипЗнч(Источник) = ТипЗнч(ПустаяСсылка()) Тогда
		Реквизиты = "Дата, ДатаПривлечения, ВалютаДокумента, ДатаВозврата, ЦФО, Проект, Организация, СтатьяДвиженияДенежныхСредств, СтатьяДвиженияДенежныхСредствОсновнойДолг, СтатьяДвиженияДенежныхСредствОсновнойДолгВозврат, ОсновнаяСтатьяИсполнение,
					|СуммаЗаимствования," 
						+ АналитикиСтатейБюджетовУХКлиентСервер.РеквизитыАналитикИзШаблона("АналитикаОсновнойДолг%1")
						+","
						+ АналитикиСтатейБюджетовУХКлиентСервер.РеквизитыАналитикИзШаблона("АналитикаОсновнойДолгВозврат%1")
						+","
						+ АналитикиСтатейБюджетовУХКлиентСервер.РеквизитыАналитикИзШаблона("АналитикаИсполнение%1")
						+","
						+ АналитикиСтатейБюджетовУХКлиентСервер.РеквизитыАналитикИзШаблона("Аналитика%1");
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, Реквизиты);	
	Иначе
		Реквизиты = Источник;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаДокумента",										Реквизиты.Дата);
	Запрос.УстановитьПараметр("Валюта",												Реквизиты.ВалютаДокумента);
	Запрос.УстановитьПараметр("Организация",										Реквизиты.Организация);
	Запрос.УстановитьПараметр("ЦФО",												Реквизиты.ЦФО);
	Запрос.УстановитьПараметр("Проект",												Реквизиты.Проект);
	Запрос.УстановитьПараметр("ДатаВозврата",										Реквизиты.ДатаВозврата);
	Запрос.УстановитьПараметр("ДатаПривлечения",									Реквизиты.ДатаПривлечения);
	Запрос.УстановитьПараметр("СтатьяДвиженияДенежныхСредств",						Реквизиты.СтатьяДвиженияДенежныхСредств);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолг1",								Реквизиты.АналитикаОсновнойДолг1);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолг2",								Реквизиты.АналитикаОсновнойДолг2);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолг3",								Реквизиты.АналитикаОсновнойДолг3);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолг4",								Реквизиты.АналитикаОсновнойДолг4);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолг5",								Реквизиты.АналитикаОсновнойДолг5);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолг6",								Реквизиты.АналитикаОсновнойДолг6);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолгВозврат1",						Реквизиты.АналитикаОсновнойДолгВозврат1);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолгВозврат2",						Реквизиты.АналитикаОсновнойДолгВозврат2);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолгВозврат3",						Реквизиты.АналитикаОсновнойДолгВозврат3);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолгВозврат4",						Реквизиты.АналитикаОсновнойДолгВозврат4);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолгВозврат5",						Реквизиты.АналитикаОсновнойДолгВозврат5);
	Запрос.УстановитьПараметр("АналитикаОсновнойДолгВозврат6",						Реквизиты.АналитикаОсновнойДолгВозврат6);
	Запрос.УстановитьПараметр("Аналитика1",											Реквизиты.Аналитика1);
	Запрос.УстановитьПараметр("Аналитика2",											Реквизиты.Аналитика2);
	Запрос.УстановитьПараметр("Аналитика3",											Реквизиты.Аналитика3);
	Запрос.УстановитьПараметр("Аналитика4",											Реквизиты.Аналитика4);
	Запрос.УстановитьПараметр("Аналитика5",											Реквизиты.Аналитика5);
	Запрос.УстановитьПараметр("Аналитика6",											Реквизиты.Аналитика6);
	Запрос.УстановитьПараметр("АналитикаИсполнение1",								Реквизиты.АналитикаИсполнение1);
	Запрос.УстановитьПараметр("АналитикаИсполнение2",								Реквизиты.АналитикаИсполнение2);
	Запрос.УстановитьПараметр("АналитикаИсполнение3",								Реквизиты.АналитикаИсполнение3);
	Запрос.УстановитьПараметр("АналитикаИсполнение4",								Реквизиты.АналитикаИсполнение4);
	Запрос.УстановитьПараметр("АналитикаИсполнение5",								Реквизиты.АналитикаИсполнение5);
	Запрос.УстановитьПараметр("АналитикаИсполнение6",								Реквизиты.АналитикаИсполнение6);
	Запрос.УстановитьПараметр("СуммаЗаимствования",									Реквизиты.СуммаЗаимствования);
	Запрос.УстановитьПараметр("ОсновнаяСтатьяИсполнение",							Реквизиты.ОсновнаяСтатьяИсполнение);
	Запрос.УстановитьПараметр("СтатьяДвиженияДенежныхСредствОсновнойДолг",			Реквизиты.СтатьяДвиженияДенежныхСредствОсновнойДолг);
	Запрос.УстановитьПараметр("СтатьяДвиженияДенежныхСредствОсновнойДолгВозврат",	Реквизиты.СтатьяДвиженияДенежныхСредствОсновнойДолгВозврат);
	
	Если НЕ ТипЗнч(Источник) = ТипЗнч(ПустаяСсылка()) Тогда
		
		ОписаниеТипаСсылки = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(ПустаяСсылка())));
		Реквизиты = "Сумма, Дата";
		ГрафикУплатыПроцентов = Источник.ГрафикУплатыПроцентов.Выгрузить(,Реквизиты);
		ГрафикУплатыПроцентов.Колонки.Добавить("Ссылка", ОписаниеТипаСсылки);
		ГрафикУплатыПроцентов.ЗаполнитьЗначения(Источник.Ссылка, "Ссылка");
		
		Запрос.УстановитьПараметр("ГрафикУплатыПроцентов", ГрафикУплатыПроцентов);
		Запрос.Текст =
		"ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ГрафикУплатыПроцентов ИЗ &ГрафикУплатыПроцентов КАК Коллекция ";
		Запрос.Выполнить();
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ЗаявкаНаПривлечениеФинансирования.", "ВТ_");
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

#КонецОбласти 

#КонецОбласти
#КонецЕсли
